<?php
error_reporting(E_ALL & ~E_NOTICE);
/*******************************************************************************************

	メールフォーム設定ファイル

	@package  mailFormConfig
	@author   oldoffice.com
	@since    PHP 4.*
	@ver      4.1.1

	@history
		2008-11-27	送信先設定を「thanks.php」から「form.config.php」に変更
		2008-11-27	複数送信先設定を可能に
		2009-11-06	送信文面、返信文面の変数名を$textに統一
		2012-10-24	変数名をWordPress対応に変更
					新しいクラスに対応 *class：send_form_mail
		2015-02-27	フォーム改編によりcheckboxは変数名だけでOK

*******************************************************************************************/

/*--------------------------------------------------------------------
	送信メール設定
--------------------------------------------------------------------*/

/* 送信先 */

	$mail_to = 'm-nishimura@ring-inc.com';
//	$mail_to = 'tera@edfc.jp';

/* 送信メール タイトル */

$title = "[" . $form_cname . "] HPからのお問い合せ";

/* 送信メール 本文 */

$text = '';
$text .= '------------------------------------------------' . "\n";
$text .= "\n";
$text .= 'お名前　　　 : ' . $form_name . "\n";
$text .= '' . "\n";
$text .= '電話番号　　 : ' . $form_tel . "\n";
$text .= "\n";
$text .= '------------------------------------------------' . "\n";
$text .= "\n";
$text .= '[ お問い合わせ内容 ]' . "\n";
$text .= "\n";
$text .= $form_message . "\n";
$text .= "\n";
$text .= '------------------------------------------------' . "\n";

$contents = $text;


/*--------------------------------------------------------------------
	自動返信メール設定
--------------------------------------------------------------------*/

/* 「on」「off」の設定 */

$auto_return = "on";

/* 送信元、タイトルの設定 */

$return_title = "お問い合せありがとうございました";

$text = '';
$text .= $form_company . "\n";
$text .= $form_name . '様' . "\n";
$text .= "\n";
$text .= 'この度は、お問い合わせいただき誠にありがとうございました。' . "\n";
$text .= '本メールは、送信いただいた皆様に自動返信しております。' . "\n";
$text .= "\n";
$text .= 'この度、お問合せいただいた内容は下記の通りです。' . "\n";
$text .= "\n";
$text .= $contents;
$text .= "\n";
$text .= 'お返事に関しましては、事情により数日かかる場合がございますので、しばらくお待ちください。'."\n";
$text .= 'よろしくお願いいたします。'."\n";
$text .= "\n";
$text .= '------------------------------------------------' . "\n";
$text .= "\n";
$text .= $form_cname."\n";
$text .= $form_czip."\n";
$text .= $form_caddress1."\n";
$text .= $form_caddress2."\n";
$text .= 'TEL : '. $form_ctel1 ."\n";
$text .= 'FAX : '. $form_ctel2 ."\n";
$text .= "\n";
$text .= '------------------------------------------------' . "\n";

$return_contents = $text;


/*--------------------------------------------------------------------
	完了画面メッセージ
--------------------------------------------------------------------*/

$ok_message      = 'ご連絡いただきありがとうございました。<br>追ってお返事いたしますのでしばらくお待ちください。';
$error_message   = 'メールが送信されませんでした。';
$no_open_message = 'このファイルは不正に開かれました。送信を実行できません。';


/*--------------------------------------------------------------------
	複数送信先設定
--------------------------------------------------------------------*/

$BCC = "on";

$BCC_mail_to = array(
	"n-takata@ring-inc.com",
	"3-a3ring@ring-inc.com"
);

/*--------------------------------------------------------------------
	メール送信元のアドレス設定　*変数に直接アドレス記入可
--------------------------------------------------------------------*/

$return_mail_from = $mail_to;
$mail_from = $form_email;

?>
